// JavaScript Document
/* 
* 正则表达式
* Copyright (c) 2013 某年某月  
* Date: 2013-04-24 
* 
*/
var pattern = /^[\u4e00-\u9fa5]+$/      // 验证中文字符


var pattern = /^([a-zA-Z0-9_\.]+)@[a-zA-Z0-9]+(\.[a-zA-Z]{2,4}){1,2}$/         //验证邮箱

var pattern = /^(https?:\/\/)?([\da-z\.-]+)\.([a-z\.]{2,6})([\/\w \.-]*)*\/?$/  //验证URL

var pattern = /^(?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)$/    //验证IP地址

var pattern = /(^(\d{3,4}-)?\d{7,8})$|(13[0-9]{9})/    //验证手机号码和固话

var pattern = /^(\d){15}|(\d){18}$/      

var pattern = /^[1-9]\d{5}[1-9]\d{3}((0[1-9])|(1[0-2]))((0[1-9])|([1-2]\d)|(3[0-1]))((\d{4})|(\d{3}x))$/        //验证身份证